# pandas---> Pandas is open-source library that is used for handle data manipulations.

In [1]:
# Data Structure of Pandas--->
# (1). Series---> It is 1-D array. It shows only values not column name.
# (2). DataFrame ---> It is multi-dimensional array. It shows values with column name.

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

# (1). Series

In [1]:
import pandas as pd

In [3]:
a= pd.Series([1,45,78,90])
a

0     1
1    45
2    78
3    90
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

# (2). Dataframe

In [5]:
a={
    'ID': [1,2,3,4,5],
    'Emp_Name': ['Sam','Rahul','Mohit','Ankit','Kriti'],
    'Department':['IT','Sales','Sales','IT','Operations'],
    'Working_hours':[8,8,8,9,9]
}

In [6]:
type(a)

dict

In [7]:
df=pd.DataFrame(a)
df

   ID Emp_Name  Department  Working_hours
0   1      Sam          IT              8
1   2    Rahul       Sales              8
2   3    Mohit       Sales              8
3   4    Ankit          IT              9
4   5    Kriti  Operations              9

# how to export your data

In [33]:
df.to_csv('sales_data.csv',index=False)

# how to import your data

In [35]:
pd.read_csv('sales_data.csv')

   ID Emp_Name  Department  Working_hours
0   1      Sam          IT              8
1   2     Ajay       Sales              8
2   3    Mohit       Sales              8
3   4    Ankit          IT              9
4   5    Kriti  Operations              9

In [56]:
#df1= pd.read_csv('wholesale.csv')
#df1

In [58]:
#df2=pd.read_csv('inventory_data.csv')
#df2

In [2]:
df3=pd.read_csv('placement.csv')
df3

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [67]:
df.columns

Index(['ID', 'Emp_Name', 'Department', 'Working_hours'], dtype='object')

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             5 non-null      int64
 1   Emp_Name       5 non-null      object
 2   Department     5 non-null      object
 3   Working_hours  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [40]:
df1= df.drop(columns = ['Working_hours'])
df1

   ID Emp_Name  Department
0   1      Sam          IT
1   2     Ajay       Sales
2   3    Mohit       Sales
3   4    Ankit          IT
4   5    Kriti  Operations

In [41]:
df.columns

Index(['ID', 'Emp_Name', 'Department', 'Working_hours'], dtype='object')

In [42]:
df.describe()

             ID  Working_hours
count  5.000000       5.000000
mean   3.000000       8.400000
std    1.581139       0.547723
min    1.000000       8.000000
25%    2.000000       8.000000
50%    3.000000       8.000000
75%    4.000000       9.000000
max    5.000000       9.000000

In [43]:
# central tendency --->  “the statistical measure that identifies a 
# single value as representative of an entire distribution.”
# The 3 most common measures of central tendency are the mean(without outlayers), median(with outlayers) and mode

In [44]:
# if you want to check top data then you will use head().
# if you want to check last data then you will use tail().

In [45]:
df.head(3)

   ID Emp_Name Department  Working_hours
0   1      Sam         IT              8
1   2     Ajay      Sales              8
2   3    Mohit      Sales              8

In [46]:
df.tail(3)

   ID Emp_Name  Department  Working_hours
2   3    Mohit       Sales              8
3   4    Ankit          IT              9
4   5    Kriti  Operations              9

In [47]:
# if you want to see random indexed data, then you will use sample().

In [48]:
df1.sample(3)

   ID Emp_Name  Department
1   2     Ajay       Sales
4   5    Kriti  Operations
0   1      Sam          IT

In [49]:
# Dataframe is mutable, it means we can change values.

In [50]:
df.head(3)

   ID Emp_Name Department  Working_hours
0   1      Sam         IT              8
1   2     Ajay      Sales              8
2   3    Mohit      Sales              8

In [59]:
df['Emp_Name'][1]='Naman'

C:\Users\Ankit Parjapati\AppData\Local\Temp\ipykernel_23692\2627379507.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Emp_Name'][1]='Naman'
C:\Users\Ankit Parjapati\AppData\Local\Temp\ipykernel_23692\2627379507.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Emp_Name'][1]='Naman'

In [60]:
df.head(3)

   ID Emp_Name Department  Working_hours
0   1      Sam         IT              8
1   2    Naman      Sales              8
2   3    Mohit      Sales              8

In [61]:
# loc and iloc method
# df.loc[row_range,column_name]
# df.iloc[row_range,column_range]

In [62]:
df.loc[2:4, ['Emp_Name','Department']]

  Emp_Name  Department
2    Mohit       Sales
3    Ankit          IT
4    Kriti  Operations

In [63]:
df.iloc[2:4, [0,1,2]]

   ID Emp_Name Department
2   3    Mohit      Sales
3   4    Ankit         IT

In [69]:
df.loc[2,['Emp_Name']]='Rohit'

In [70]:
df.iloc[2:4, [0,1,2]]

   ID Emp_Name Department
2   3    Rohit      Sales
3   4    Ankit         IT

In [71]:
df

   ID Emp_Name  Department  Working_hours
0   1      Sam          IT              8
1   2    Naman       Sales              8
2   3    Rohit       Sales              8
3   4    Ankit          IT              9
4   5    Kriti  Operations              9

In [72]:
s=df.axes
s

[RangeIndex(start=0, stop=5, step=1),
 Index(['ID', 'Emp_Name', 'Department', 'Working_hours'], dtype='object')]

In [73]:
p=df.dtypes
p

ID                int64
Emp_Name         object
Department       object
Working_hours     int64
dtype: object

In [74]:
d=df.empty # it return true if there any missing data in dataframe otherwise return false.
d

False

In [75]:
df.isnull().sum() # for checking missing values.

ID               0
Emp_Name         0
Department       0
Working_hours    0
dtype: int64

In [76]:
df.dropna() # remove missing values.

   ID Emp_Name  Department  Working_hours
0   1      Sam          IT              8
1   2    Naman       Sales              8
2   3    Rohit       Sales              8
3   4    Ankit          IT              9
4   5    Kriti  Operations              9

In [78]:
i=df.ndim # number of axes (it is 2)
i

2

In [80]:
t= df.shape # shape= n(rows), n(columns)
t

(5, 4)

In [81]:
d= df.size  # row count * column count
d

20

In [82]:
a= df.values  # get a numpy array for df
a

array([[1, 'Sam', 'IT', 8],
       [2, 'Naman', 'Sales', 8],
       [3, 'Rohit', 'Sales', 8],
       [4, 'Ankit', 'IT', 9],
       [5, 'Kriti', 'Operations', 9]], dtype=object)

In [84]:
df1= df.copy()

In [87]:
p = df.sort_values(by='Emp_Name') # it will arrange data in asscending order according to column name given.
p

   ID Emp_Name  Department  Working_hours
3   4    Ankit          IT              9
4   5    Kriti  Operations              9
1   2    Naman       Sales              8
2   3    Rohit       Sales              8
0   1      Sam          IT              8

In [35]:
df3=pd.read_csv('placement.csv')
df3

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [36]:
# x= df.astype(int)  @ type conversion
df3['cgpa'] = df3['cgpa'].astype(int)
df3

    cgpa  resume_score  placed
0      8          6.52       1
1      6          5.17       0
2      8          8.86       1
3      6          7.27       1
4      7          7.30       1
..   ...           ...     ...
95     6          6.38       0
96     8          7.76       1
97     6          7.78       0
98     8          5.63       1
99     6          6.61       0

[100 rows x 3 columns]

In [37]:
df3['cgpa']=df3['cgpa'].add(4)
df3

    cgpa  resume_score  placed
0     12          6.52       1
1     10          5.17       0
2     12          8.86       1
3     10          7.27       1
4     11          7.30       1
..   ...           ...     ...
95    10          6.38       0
96    12          7.76       1
97    10          7.78       0
98    12          5.63       1
99    10          6.61       0

[100 rows x 3 columns]

In [38]:
s=df3.count()
s

cgpa            100
resume_score    100
placed          100
dtype: int64

In [39]:
p=df3.max()
p

cgpa            13.00
resume_score     9.06
placed           1.00
dtype: float64

In [40]:
q=df3.min()
q

cgpa            9.00
resume_score    4.95
placed          0.00
dtype: float64

In [41]:
r=df3['cgpa'].mean()
r

10.47

In [42]:
d=df3['cgpa'].median()
d

10.0

In [43]:
s=df3.sum()
s

cgpa            1047.00
resume_score     693.05
placed            50.00
dtype: float64

In [44]:
g=df3.filter(items=['cgpa','placed']) # 1st method
g

    cgpa  placed
0     12       1
1     10       0
2     12       1
3     10       1
4     11       1
..   ...     ...
95    10       0
96    12       1
97    10       0
98    12       1
99    10       0

[100 rows x 2 columns]

In [45]:
df3[['cgpa','placed']]  # 2nd method

    cgpa  placed
0     12       1
1     10       0
2     12       1
3     10       1
4     11       1
..   ...     ...
95    10       0
96    12       1
97    10       0
98    12       1
99    10       0

[100 rows x 2 columns]

In [46]:
s=df3.filter(items=[5,6],axis=0) ## axis=0 means row wise operation
s

   cgpa  resume_score  placed
5    12          6.19       1
6     9          7.09       0

In [47]:
p=df3.rename(columns={'cgpa':'updated_cgpa',
                     'resume_score':'semester_marks'})  # how to rename a column
p

    updated_cgpa  semester_marks  placed
0             12            6.52       1
1             10            5.17       0
2             12            8.86       1
3             10            7.27       1
4             11            7.30       1
..           ...             ...     ...
95            10            6.38       0
96            12            7.76       1
97            10            7.78       0
98            12            5.63       1
99            10            6.61       0

[100 rows x 3 columns]

In [48]:
df3['half']=df3['cgpa'].where(df3['cgpa']>7,other=0)
df3.head(10)

   cgpa  resume_score  placed  half
0    12          6.52       1    12
1    10          5.17       0    10
2    12          8.86       1    12
3    10          7.27       1    10
4    11          7.30       1    11
5    12          6.19       1    12
6     9          7.09       0     9
7    10          6.29       0    10
8    10          6.71       0    10
9    11          7.12       1    11